app/views/users/index.html.erb

SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
        <td><%- first_user = user -%>
            <%- micropost = first_user.microposts.first -%>